streetCanyon_CFDHAM/system/street/setset.batch
cellSet soil new boxToCell (60.0 -2.0 100.0)(70.0 -0.1 150.0)
cellZoneSet soil new setToCellZone soil
cellSet brick new boxToCell (60.0 -0.1 100.0)(70.0 0 150.0)
cellZoneSet brick new setToCellZone brick
